src/toir_cf/src/Documents/торо_УчетКонтролируемыхПоказателей/торо_УчетКонтролируемыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_УчетКонтролируемыхПоказателей</name>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <basedOn>Document.торо_АктОВыполненииЭтапаРабот</basedOn>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <registerRecords>InformationRegister.торо_ЗначенияКонтролируемыхПоказателей</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыРемонтаСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредыдущееЗначение</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонтроля</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКритическийМаксимум</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьДопустимыйМаксимум</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьДопустимыйМинимум</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКритическийМинимум</name>
      <type>
        <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/InformationRegisters/торо_ВводНаОсновании/торо_ВводНаОсновании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВводНаОсновании</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументВводимый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/ChartsOfCharacteristicTypes/торо_ИзмеряемыеПоказателиОбъектовРемонта/торо_ИзмеряемыеПоказателиОбъектовРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>торо_ИзмеряемыеПоказателиОбъектовРемонта</name>
  <type>
    <types>Number</types>
    <types>CatalogRef.торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>4</scale>
    </numberQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДопустимыйМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимыйМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КритическийМаксимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>КритическийМинимум</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗамера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

src/toir_cf/src/Documents/торо_УчетКонтролируемыхПоказателей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
#Область Печать

// Заполняет список команд печати.
//
// Параметры:
// КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Учет контролируемых показателей
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_УчетКонтролируемыхПоказателей";
	КомандаПечати.Идентификатор = "УчетКонтролируемыхПоказателей";
	КомандаПечати.Представление = НСтр("ru = 'Учет контролируемых показателей'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ПечатьДокументовБезПредварительногоПросмотра",
	Ложь);
	
КонецПроцедуры

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	ИменаОбъектовМетаданных = РегистрыСведений.торо_ВводНаОсновании.ИменаДоступныхОбъектовМетаданныхДляВводаНаОсновании(
		 Метаданные.Документы.торо_УчетКонтролируемыхПоказателей.Имя);
		 
	Для Каждого ИмяОбъектаМетаданных Из ИменаОбъектовМетаданных Цикл
		Документы[ИмяОбъектаМетаданных].ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);		 
	КонецЦикла;		 
		
КонецПроцедуры

// Добавляет команду создания документа "Учет контролируемых показателей".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.торо_УчетКонтролируемыхПоказателей) Тогда
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.торо_УчетКонтролируемыхПоказателей.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.торо_УчетКонтролируемыхПоказателей);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Записывать";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "торо_УчетКонтролируемыхПоказателей";
        Возврат КомандаСоздатьНаОсновании;
	КонецЕсли; 
	
    Возврат Неопределено;
	
КонецФункции

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "УчетКонтролируемыхПоказателей") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"УчетКонтролируемыхПоказателей", 
		"Учет контролируемых показателей", 
		ПечатьКонтролируемыхПоказателей(МассивОбъектов, ПараметрыПечати),
		,
		"Документ.торо_УчетКонтролируемыхПоказателей.ПФ_MXL_УчетКонтролируемыхПоказателей");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьКонтролируемыхПоказателей(МассивОбъектов, ПараметрыПечати)

	ТабДок = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_УчетКонтролируемыхПоказателей.ПФ_MXL_УчетКонтролируемыхПоказателей");
	
	ЗапросШапки = Новый Запрос;
	ЗапросШапки.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_УчетКонтролируемыхПоказателей.Ссылка КАК Ссылка,
	|	торо_УчетКонтролируемыхПоказателей.Номер КАК Номер,
	|	торо_УчетКонтролируемыхПоказателей.Дата КАК Дата,
	|	торо_УчетКонтролируемыхПоказателей.Организация КАК Организация,
	|	торо_УчетКонтролируемыхПоказателей.Подразделение КАК Подразделение,
	|	торо_УчетКонтролируемыхПоказателей.Ответственный КАК Ответственный,
	|	торо_УчетКонтролируемыхПоказателей.Комментарий КАК Комментарий,
	|	торо_УчетКонтролируемыхПоказателей.Показатели.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ОбъектРемонта КАК ОбъектРемонта,
	|		Показатель КАК Показатель,
	|		Значение КАК Значение,
	|		ПредыдущееЗначение КАК ПредыдущееЗначение,
	|		ДатаКонтроля КАК ДатаКонтроля
	|	) КАК Показатели
	|ИЗ
	|	Документ.торо_УчетКонтролируемыхПоказателей КАК торо_УчетКонтролируемыхПоказателей
	|ГДЕ
	|	торо_УчетКонтролируемыхПоказателей.Ссылка В(&Ссылка)";
	
	ЗапросШапки.УстановитьПараметр("Ссылка", МассивОбъектов);
	ВыборкаШапки = ЗапросШапки.Выполнить().Выбрать();
	
	ЭтоПервый = Истина;
	
	Пока ВыборкаШапки.Следующий() Цикл	
		Если НЕ ЭтоПервый Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ЭтоПервый = Ложь;
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		СтрокаТаблициОР = Макет.ПолучитьОбласть("СтрокаТаблициОР");
		СтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		Шапка.Параметры.Заполнить(ВыборкаШапки);
		Шапка.Параметры.Организация = торо_ЗаполнениеДокументов.ПолучитьПредставлениеОрганизацииДляПечати(ВыборкаШапки.Организация);
		ТабДок.Вывести(Шапка);
		
		Ном = 1;                                                   
		СтароеЗначение  = Справочники.торо_ОбъектыРемонта.ПустаяСсылка();
		ТабПоказателей = ВыборкаШапки.Показатели.Выгрузить();
		СписокОР = ТабПоказателей.ВыгрузитьКолонку("ОбъектРемонта");
		СписокПоказателейДляОтбора = ТабПоказателей.ВыгрузитьКолонку("Показатель");
		
		ТаблицаПоказателей = ПланыВидовХарактеристик.торо_ИзмеряемыеПоказателиОбъектовРемонта.ПолучитьСтруктуруИзмеряемыхПоказателейОбъектовРемонта(СписокОР,СписокПоказателейДляОтбора,Истина,,,Истина);		
		ТаблицаПоказателей.Индексы.Добавить("ИсходныйОР");
		ТаблицаПоказателей.Индексы.Добавить("Показатель");
		
		Для Каждого Строка Из ТабПоказателей Цикл	
					
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ИсходныйОР",Строка.ОбъектРемонта);
			ПараметрыОтбора.Вставить("Показатель",Строка.Показатель);
			
			НайденныеСтроки = ТаблицаПоказателей.НайтиСтроки(ПараметрыОтбора);
			
			Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
				
				Если ТипЗнч(Строка.Значение) <> Тип("СправочникСсылка.торо_ЗначенияИзмеряемыхПоказателейОбъектовРемонта") Тогда
					
					Если Строка.Значение <= НайденныеСтроки[0].ДопустимыйМаксимум
						И Строка.Значение >= НайденныеСтроки[0].ДопустимыйМинимум Тогда
						СтрокаТаблицы.Параметры.Отклонение = "Нормальное";						
					ИначеЕсли Строка.Значение <= НайденныеСтроки[0].КритическийМаксимум И Строка.Значение > НайденныеСтроки[0].ДопустимыйМаксимум
						ИЛИ Строка.Значение >= НайденныеСтроки[0].КритическийМинимум И Строка.Значение < НайденныеСтроки[0].ДопустимыйМинимум Тогда
						СтрокаТаблицы.Параметры.Отклонение = "Недопустимое";	
					ИначеЕсли Строка.Значение > НайденныеСтроки[0].КритическийМаксимум
						ИЛИ Строка.Значение < НайденныеСтроки[0].КритическийМинимум Тогда
						СтрокаТаблицы.Параметры.Отклонение = "Критическое";	
					КонецЕсли;
				Иначе
					
					ВыделятьКакНедопустимоеЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Значение, "ВыделятьКакНедопустимоеЗначение");
					ВыделятьКакКритическоеЗначение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Значение, "ВыделятьКакКритическоеЗначение");
					
					Если ВыделятьКакКритическоеЗначение = Истина Тогда
						СтрокаТаблицы.Параметры.Отклонение = "Критическое";
					ИначеЕсли ВыделятьКакНедопустимоеЗначение = Истина Тогда
						СтрокаТаблицы.Параметры.Отклонение = "Недопустимое";
					Иначе
						СтрокаТаблицы.Параметры.Отклонение = "Нормальное";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				СтрокаТаблицы.Параметры.Отклонение = "Критическое";
			КонецЕсли;
			
			Если Строка.ОбъектРемонта <> СтароеЗначение Тогда		
				СтрокаТаблициОР.Параметры.Н = Ном;
				СтрокаТаблициОР.Параметры.Заполнить(Строка);
				СтрокаТаблициОР.Параметры.ОбъектРемонта = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Строка.ОбъектРемонта);
				Если Не ЗначениеЗаполнено(Строка.ДатаКонтроля) Тогда
					СтрокаТаблициОР.Параметры.ДатаКонтроля = ВыборкаШапки.Дата;	
				КонецЕсли; 
				ТабДок.Вывести(СтрокаТаблициОР);
				СтароеЗначение = Строка.ОбъектРемонта;
				Ном = Ном + 1;
			КонецЕсли;
			СтрокаТаблицы.Параметры.ЕдиницаИзмерения = Строка.Показатель.ЕдиницаИзмерения;	
			СтрокаТаблицы.Параметры.Заполнить(Строка);
			ТабДок.Вывести(СтрокаТаблицы);
			
		КонецЦикла;
		
		Подвал.Параметры.Ответственный = ВыборкаШапки.Ответственный;
		Подвал.Параметры.Комментарий = ВыборкаШапки.Комментарий;
		
		ТабДок.Вывести(Подвал);
		
	КонецЦикла;
	
	ТабДок.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб         = Истина;
	ТабДок.ТолькоПросмотр      = Истина;
	ТабДок.ОтображатьСетку     = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.КлючПараметровПечати = "торо_ПечатьКонтролируемыхПоказателей";
	Возврат ТабДок;
	
КонецФункции // ПечатьКонтролируемыхПоказателей()

#КонецОбласти

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	Реквизиты.Добавить("ИзМобильного");
		
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ 
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ДляВсехСтрок(&Ограничение_ОР)";

	ОграничениеОР = торо_УправлениеДоступом.ПолучитьОграничениеДоступаДляОбъектаРемонтаВТаблице("Показатели.ОбъектРемонта", Истина);
	Ограничение.Текст = СтрЗаменить(Ограничение.Текст, "&Ограничение_ОР", ОграничениеОР);

	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецЕсли
